#define _CRT_SECURE_NO_WARNINGS 1	
#include<stdio.h>
//int main()
//{
//	int a = 1;
//	int b = 4;
//	printf("%d", a + b * 7);
//	return 0;
//}
//int main()
//{    //char类型都未达到int的大小，此处就会发生整形提升。 
//	//整形提升是按照变量的数据类型的符号位来提升的。
//	//如负数整形提升前面全补1，正数全补0，无符号数全部补零。
//	char a = 3;
//	//00000011
//	char b = 127;
//	//01111111
//	char c = a + b;
//	//运算时整形提升，a变为00000000000000000000000000000011，b变为00000000000000000000000001111111，
//	//运算结果为000000000000000000000000100000010，
//	//放c中截断，为100000010
//	//打印时为%d，需整形提升，为111111111111111111111111100000010 - 补码
//	//                          111111111111111111111111100000001 - 反码
//	//                          100000000000000000000000011111110 - 源码，为-126
//	//故结果为-126.
//	printf("%d", c);
//	return 0;
//}
//int main()
//{
//	char a = 0xb6;
//	short b = 0xb600;
//	int c = 0xb6000000;//十六进制中的00表示二进制中的00000000，即b6000000为10110110000000000000000000000000
//	if (a == 0xb6)
//	{
//		printf("a");
//	}
//	if (b == 0xb600)
//	{
//		printf("b");
//	}
//	if (c == 0xb6000000)
//	{
//		printf("c");
//	}
//	//只打印c，因为a,b在运算时发生整形提升，提升后与原量不等，而c不发生，与原量相同。
//	return 0;
//}
//int main()
//{
//	char c = 1;
//	printf("%u\n", sizeof(c));
//	printf("%u\n", sizeof(+c));//运算时会发生整形提升。
//	printf("%u\n", sizeof(-c));
//	return 0;
//}
//int main()
//{
//	//按照此表排名发生算术转换，即运算前将排名低的转化为排名高的那一个的类型。
//	//long double
//	//doubie
//	//float
//	//unsigned long int
//	//long int
//	//unsigned long int
//	//int
//	int a = 4;
//	float f = 4.5;
//	printf("%f",  a+f);
//	return 0;
//}
//int main()
//{
//	int a = 5;
//	int b = 0;
//	b = a + --a;
//	printf("%d", b);
//	return 0;
//}